# -*- coding: utf-8 -*-
"""
@author: ASUS
"""

def remove_spec(query):
    spec_list = ["á", "é", "í", "ó", "ö", "ő", "ú", "ü", "ű", "Á", "É", "Í", "Ó", "Ö", "Ő", "Ú", "Ü", "Ű","ř","ş","â","ä","ø","ñ","å","æ","ț","č","ç","ğ","à","Ł","ę","ł","ń","ž","Š","Ž","š","ć","î","ä","ı","â","ç","ń","è","ø","š","ň","ã","č","ł","ę","Ç","Ś","Ž","Š","ą","õ"]
    change_list = ["a", "e", "i", "o", "o", "o", "u", "u", "u","a", "e", "i", "o", "o", "o", "u", "u", "u","r","s","a","a","o","n","a","a","t","c","c","g","a","L","e","l","n","z","S","Z","s","c","i","a","i","a","c","n","e","o","s","n","a","c","l","e","C","S","Z","S","a","o"]
    for i in range(len(spec_list)):
        query = query.replace(spec_list[i], change_list[i])
    return query